# LegendPosition Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialFieldManager..::..LegendPosition Property
SpatialFieldManager Class See Also
---
Stores current position of analysis results legend element in view
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public XYZ LegendPosition { get; set; }
```

Visual Basic
---
```text
Public Property LegendPosition As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ LegendPosition {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace